app/Controllers/Tamu.php

SELECT *
FROM `tb_tamu`
---
    public function index()
    {
        $tamu_model = new TamuModel();
        $all_data_tamu = $tamu_model->findAll();

INSERT INTO `tb_tamu` (`tgl_berkunjung`, `nama_tamu`, `no_telepon`, `alamat`, `keperluan`) VALUES ('', '', '', '', '')
---
    public function proses_add_tamu()
    {
        $tamu_model = new TamuModel();
        $tamu_model->insert($this->request->getPost());

SELECT *
FROM `tb_tamu`
WHERE `tb_tamu`.`id` = '4'
---
    public function edit_data_tamu($id = false)
    {
        $tamu_model = new TamuModel();
        $data_tamu = $tamu_model->find($id);

DELETE FROM `tb_tamu`
WHERE `id` IN ('5')
---
    public function delete_data_tamu($id = false)
    {
        $tamu_model = new TamuModel();
        $tamu_model->delete($id);